In [2]:
print("Basic Pandas Demo")
import pandas as pd

Basic Pandas Demo

In [5]:
s1 = pd.Series()
print(s1)

Series([], dtype: object)

In [6]:
s2 = pd.Series([10,20,30,40,50])
print(s2)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
s3 = pd.Series([10,20,30,40,50], index = ['A','B','C','D','E'])
print(s3)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [8]:
s4 = pd.Series([10,20,30,40,50], index = ['A','B','C','D','F'], dtype = 'f')
print(s4)

A    10.0
B    20.0
C    30.0
D    40.0
F    50.0
dtype: float32

In [9]:
# Tuple to Series

t1 = (10,20,30,40,50)
s5 = pd.Series((t1))
print(s5)
print(type(s5))

0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
# Dictionary to Series

dict1 = {
    "Id" : 101,
    "Name" : "Suratwala",
    "Des" : "Manager"
}

s6 = pd.Series((dict1))
print(type(s6))
print(s6)

<class 'pandas.core.series.Series'>
Id            101
Name    Suratwala
Des       Manager
dtype: object

In [12]:
s7 = pd.Series("Python",range(10))
print(s7)

0    Python
1    Python
2    Python
3    Python
4    Python
5    Python
6    Python
7    Python
8    Python
9    Python
dtype: object

In [13]:
# DataFrame

D1 = pd.DataFrame()
print(D1)
print(type(D1))

Empty DataFrame
Columns: []
Index: []
<class 'pandas.core.frame.DataFrame'>

In [14]:
D2 = pd.DataFrame([[1,2,3],[4,5,6]])
D2

   0  1  2
0  1  2  3
1  4  5  6

In [ ]:
D2 = pd.DataFrame([[[1,2,3],[4,5,6],[7,8,9]]], index= ["row1","row2"] , columns = ["column1","column2","column3"])
D2

        column1    column2    column3
row1  [1, 2, 3]  [4, 5, 6]  [7, 8, 9]
row2  [1, 2, 3]  [4, 5, 6]  [7, 8, 9]

In [33]:
d1 = {"Name" : ["ABC","BCD"], "Age" : [10,20]}
d2 = {"Name" : ["CFR","BCD"], "Age" : [50,20]}
d1

{'Name': ['ABC', 'BCD'], 'Age': [10, 20]}

In [34]:
DF1 = pd.DataFrame(d1)
DF1
DF2 = pd.DataFrame(d2)
DF2

  Name  Age
0  CFR   50
1  BCD   20

In [39]:
concat = pd.concat((DF1,DF2),ignore_index = True)
concat

  Name  Age
0  ABC   10
1  BCD   20
2  CFR   50
3  BCD   20

In [41]:
pd.merge(DF2,DF1, how = "right", on="Name")

  Name  Age_x  Age_y
0  ABC    NaN     10
1  BCD   20.0     20

In [42]:
pd.merge(DF1,DF2,how = "left",on = "Age")

  Name_x  Age Name_y
0    ABC   10    NaN
1    BCD   20    BCD

In [43]:
pd.merge(DF1,DF2,how = "inner",on = "Name")

  Name  Age_x  Age_y
0  BCD     20     20

In [44]:
pd.merge(DF1,DF2,how = "outer",on = "Name")

  Name  Age_x  Age_y
0  ABC   10.0    NaN
1  BCD   20.0   20.0
2  CFR    NaN   50.0

In [ ]:
# -----